/*
    by korenkonder
    GitHub/GitLab: korenkonder
*/

#include <math.h>
#include <stdint.h>
#include <stdlib.h>

// Helper part

#define X64 INTPTR_MAX == INT64_MAX
#define WIN WIN32 || _WIN32 || defined __CYGWIN__

#ifdef WIN
#define FORCE_INLINE __forceinline
#else
#define FORCE_INLINE __attribute__((always_inline)) inline
#endif

#define free(ptr) if (ptr) free((void*)ptr); ptr = 0;

#ifdef bool
#undef bool
#endif

typedef char bool;
#define true 1
#define false 0

typedef struct
{
    float x;
    float y;
    float z;
} vec3;

typedef struct
{
    float x;
    float y;
    float z;
    float w;
} quat;

typedef struct
{
    quat quat;
    vec3 trans;
    float time;
} quat_trans;

static quat_trans quat_trans_identity = { { 0.0f, 0.0f, 0.0f, 1.0f }, { 0.0f, 0.0f, 0.0f }, 0.0f };

const char* is_null = "\"%s\" is null\n";
const char* cant_allocate = "Can't allocate memory for \"%s\"\n";
const char* cant_allocate_inner = "Can't allocate memory for %s\n";

FORCE_INLINE float dot_quat(quat* x, quat* y) {
    float z = x->x * y->x + x->y * y->y + x->z * y->z + x->w * y->w;
    return z;
}

FORCE_INLINE float length_quat(quat* x) {
    float z = x->x * x->x + x->y * x->y + x->z * x->z + x->w * x->w;
    return sqrtf(z);
}

FORCE_INLINE float length_squared_quat(quat* x) {
    float z = x->x * x->x + x->y * x->y + x->z * x->z + x->w * x->w;
    return z;
}

FORCE_INLINE void normalize_quat(quat* x) {
    float length = length_quat(x);
    if (length != 0)
        length = 1.0f / length;

    x->x *= length;
    x->y *= length;
    x->z *= length;
    x->w *= length;
}

FORCE_INLINE float lerpf(float x, float y, float blend) {
    float b0, b1;
    b0 = blend;
    b1 = 1.0f - blend;
    return x * b1 + y * b0;
}

FORCE_INLINE void lerp_vec3(vec3* x, vec3* y, vec3* z, float blend) {
    float b0, b1;
    b0 = blend;
    b1 = 1.0f - blend;
    z->x = x->x * b1 + y->x * b0;
    z->y = x->y * b1 + y->y * b0;
    z->z = x->z * b1 + y->z * b0;
}

void slerp_quat(quat* x, quat* y, quat* z, float blend) {
    if (length_squared_quat(x) == 0.0f) {
        if (length_squared_quat(y) == 0.0f) {
            z->x = z->y = z->z = 0.0f;
            z->w = 1.0f;
        }
        else
            *z = *y;
        return;
    }
    else if (length_squared_quat(y) == 0.0f) {
        *z = *x;
        return;
    }

    float cos_half_angle = dot_quat(x, y);
    if (cos_half_angle >= 1.0f || cos_half_angle <= -1.0f) {
        *z = *x;
        return;
    }

    *z = *y;

    if (cos_half_angle < 0.0f) {
        z->x = -z->x;
        z->y = -z->y;
        z->z = -z->z;
        z->w = -z->w;
        cos_half_angle = -cos_half_angle;
    }

    float b[2], half_angle, sin_half_angle, one_over_sin_half_angle;
    if (cos_half_angle < 0.99f) {
        half_angle = acosf(cos_half_angle);
        sin_half_angle = sinf(half_angle);
        one_over_sin_half_angle = 1.0f / sin_half_angle;
        b[0] = sinf(half_angle * (1.0f - blend)) * one_over_sin_half_angle;
        b[1] = sinf(half_angle * blend) * one_over_sin_half_angle;
    }
    else {
        b[0] = 1.0f - blend;
        b[1] = blend;
    }

    z->x = x->x * b[0] + z->x * b[1];
    z->y = x->y * b[0] + z->y * b[1];
    z->z = x->z * b[0] + z->z * b[1];
    z->w = x->w * b[0] + z->w * b[1];
    normalize_quat(z);
}

FORCE_INLINE void lerp_quat_trans(quat_trans* x, quat_trans* y, quat_trans* z, float blend)
{
    if (blend > 1.0f)
        blend = 1.0f;
    else if (blend < 0.0f)
        blend = 0.0f;

    slerp_quat(&x->quat, &y->quat, &z->quat, blend);
    lerp_vec3(&x->trans, &y->trans, &z->trans, blend);
    z->time = lerpf(x->time, y->time, blend);
}

// Enbaya part

typedef struct {
    quat_trans qt[2];
    quat quat;
    vec3 trans;
    uint8_t flags;
    uint8_t padding[3];
} enb_track;

typedef struct {
    uint32_t signature;                   // 0x00
    uint32_t track_count;                 // 0x04
    float scale;                          // 0x08
    float duration;                       // 0x0C
    uint32_t samples;                     // 0x10
    uint32_t track_data_init_mode_length; // 0x14
    uint32_t track_data_init_i8_length;   // 0x18
    uint32_t track_data_init_i16_length;  // 0x1C
    uint32_t track_data_init_i32_length;  // 0x20
    uint32_t track_data_mode_length;      // 0x24
    uint32_t track_data_mode2_length;     // 0x28
    uint32_t track_data_i8_length;        // 0x2C
    uint32_t track_data_i16_length;       // 0x30
    uint32_t track_data_i32_length;       // 0x44
    uint32_t params_mode_length;          // 0x38
    uint32_t params_u8_length;            // 0x3C
    uint32_t params_u16_length;           // 0x40
    uint32_t params_u32_length;           // 0x44
    uint32_t track_flags_length;          // 0x48
    uint32_t unknown;                     // In runtime becomes pointer to data after this uint32_t
} enb_head;

typedef struct {
    int32_t current_sample;             // 0x00
    float current_sample_time;          // 0x04
    float previous_sample_time;         // 0x08
    enb_head* data_header;              // 0x0C
    enb_track* track_data;              // 0x10
    uint32_t data_length;               // 0x14
    uint32_t unknown[2];                // 0x18
    float requested_time;               // 0x20
    float seconds_per_sample;           // 0x24
    uint32_t next_params_change;        // 0x28
    uint32_t prev_params_change;        // 0x2C
    uint8_t* track_flags;               // 0x30
    uint8_t* track_data_init_mode;      // 0x34
    int8_t* track_data_init_i8;         // 0x38
    int16_t* track_data_init_i16;       // 0x3C
    int32_t* track_data_init_i32;       // 0x40
    uint8_t track_data_init_counter;    // 0x44
    uint8_t padding[3];                 // 0x45
    uint8_t* track_data_mode;           // 0x48
    uint8_t* track_data_mode2;          // 0x4C
    int8_t* track_data_i8;              // 0x50
    int16_t* track_data_i16;            // 0x54
    int32_t* track_data_i32;            // 0x58
    uint8_t track_data_mode_counter;    // 0x5C
    uint8_t track_data_mode2_counter;   // 0x5D
    uint8_t padding2[2];                // 0x5E
    uint8_t* params_mode;               // 0x60
    uint8_t* params_u8;                 // 0x64
    uint16_t* params_u16;               // 0x68
    uint32_t* params_u32;               // 0x6C
    uint8_t params_counter;             // 0x70
    uint8_t padding3[3];                // 0x71
    uint8_t* orig_track_data_init_mode; // 0x74
    int8_t* orig_track_data_init_i8;    // 0x78
    int16_t* orig_track_data_init_i16;  // 0x7C
    int32_t* orig_track_data_init_i32;  // 0x80
    uint8_t* orig_track_data_mode;      // 0x84
    uint8_t* orig_track_data_mode2;     // 0x88
    int8_t* orig_track_data_i8;         // 0x8C
    int16_t* orig_track_data_i16;       // 0x90
    int32_t* orig_track_data_i32;       // 0x94
    uint8_t* orig_params_mode;          // 0x98
    uint8_t* orig_params_u8;            // 0x9C
    uint16_t* orig_params_u16;          // 0xA0
    uint32_t* orig_params_u32;          // 0xA4
    uint8_t track_mode_selector;        // 0xA8
    uint8_t track_data_selector;        // 0xA9
    uint8_t padding4[6];                // 0xAA
} enb_play_head;

extern int32_t enb_process(uint8_t* data_in, uint8_t** data_out,
    size_t* data_out_len, float* duration, float* fps, size_t* frames);
extern int32_t enb_initialize(uint8_t* data, enb_play_head** play_head);
extern void enb_free(enb_play_head** play_head);
extern void enb_get_track_data(enb_play_head* play_head, size_t track, quat_trans* data);
extern void enb_set_time(enb_play_head* play_head, float time);

const uint8_t shift_table_1[] = { 6, 4, 2, 0 }; // 0x08BF1CE8, 0x08BF2160, 0x08BF210
const uint8_t shift_table_2[] = { 4, 0 };       // 0x08BF1CF8
const int8_t value_table_1[] = { 0, 1, 0, -1 }; // 0x08BB3FC0
const int8_t value_table_2[] = { 0, 8, 2, 3, 4, 5, 6, 7, -8, -7, -6, -5, -4, -3, -2, -9 }; // 0x08BB3FD0

static void enb_init(enb_play_head* play_head, enb_head* head);
static void enb_copy_pointers(enb_play_head* play_head);
static void enb_get_track_unscaled_init(enb_play_head* play_head);
