/*
    by korenkonder
    GitHub/GitLab: korenkonder
*/

#include <math.h>
#include <stdlib.h>

// Helper part

typedef unsigned char bool;
typedef char sbyte;
typedef unsigned char byte;
typedef unsigned short ushort;
typedef unsigned int uint;

#define true 1
#define false 0

#define FREE(ptr) if (ptr) free((void*)ptr); ptr = 0;

typedef struct _vec3
{
    float x;
    float y;
    float z;
} vec3;

typedef struct _vec4
{
    float x;
    float y;
    float z;
    float w;
} vec4;

typedef struct _quat_trans_time
{
    vec4 quat;
    vec3 trans;
    float time;
} quat_trans_time;

typedef struct _track
{
    quat_trans_time qtt[2];
    vec4 quat;
    vec3 trans;
    byte flags;
    byte padding[3];
} track;

const char* is_null = "\"%s\" is null\n";
const char* cant_allocate = "Can't allocate memory for \"%s\"\n";
const char* cant_allocate_inner = "Can't allocate memory for %s\n";

static float dot_vec4(vec4* x, vec4* y)
{
    float z = x->x * y->x + x->y * y->y + x->z * y->z + x->w * y->w;
    return z;
}

static float length_vec4(vec4* x)
{
    float z = x->x * x->x + x->y * x->y + x->z * x->z + x->w * x->w;
    return (float)sqrt(z);
}

static float length_squared_vec4(vec4* x)
{
    float z = x->x * x->x + x->y * x->y + x->z * x->z + x->w * x->w;
    return z;
}

static void normalize_vec4(vec4* x)
{
    float length = length_vec4(x);
    if (length != 0)
        length = 1.0f / length;

    x->x *= length;
    x->y *= length;
    x->z *= length;
    x->w *= length;
}

static float lerpf(float x, float y, float blend)
{
    float b0, b1;
    b0 = blend;
    b1 = 1.0f - blend;
    return x * b1 + y * b0;
}

static void lerp_vec3(vec3* x, vec3* y, vec3* z, float blend)
{
    float b0, b1;
    b0 = blend;
    b1 = 1.0f - blend;
    z->x = x->x * b1 + y->x * b0;
    z->y = x->y * b1 + y->y * b0;
    z->z = x->z * b1 + y->z * b0;
}

static void slerp(vec4* x, vec4* y, vec4* z, float blend)
{
    if (length_squared_vec4(x) == 0.0f)
    {
        if (length_squared_vec4(y) == 0.0f)
        {
            z->x = z->y = z->z = 0.0f;
            z->w = 1.0f;
        }
        else
        {
            *z = *y;
        }
        return;
    }
    else if (length_squared_vec4(y) == 0.0f)
    {
        *z = *x;
        return;
    }

    float cosHalfAngle = dot_vec4(x, y);
    if (cosHalfAngle >= 1.0f || cosHalfAngle <= -1.0f)
    {
        *z = *x;
        return;
    }

    *z = *y;

    if (cosHalfAngle < 0.0f)
    {
        z->x = -z->x;
        z->y = -z->y;
        z->z = -z->z;
        z->w = -z->w;
        cosHalfAngle = -cosHalfAngle;
    }

    float blendA, blendB, halfAngle, sinHalfAngle, oneOverSinHalfAngle;
    if (cosHalfAngle < 0.99f)
    {
        halfAngle = acosf(cosHalfAngle);
        sinHalfAngle = sinf(halfAngle);
        oneOverSinHalfAngle = 1.0f / sinHalfAngle;
        blendA = sinf(halfAngle * (1.0f - blend)) * oneOverSinHalfAngle;
        blendB = sinf(halfAngle * blend) * oneOverSinHalfAngle;
    }
    else
    {
        blendA = 1.0f - blend;
        blendB = blend;
    }

    z->x = x->x * blendA + z->x * blendB;
    z->y = x->y * blendA + z->y * blendB;
    z->z = x->z * blendA + z->z * blendB;
    z->w = x->w * blendA + z->w * blendB;
    normalize_vec4(z);
}

static void lerp_quat_trans_time(quat_trans_time* x, quat_trans_time* y, quat_trans_time* z, float blend)
{
    if (blend > 1.0f)
        blend = 1.0f;
    else if (blend < 0.0f)
        blend = 0.0f;

    slerp(&x->quat, &y->quat, &z->quat, blend);
    lerp_vec3(&x->trans, &y->trans, &z->trans, blend);
    z->time = lerpf(x->time, y->time, blend);
}

// Enbaya part

typedef struct _enb_head
{
    int signature;                      // 0x00
    int track_count;                    // 0x04
    float scale;                        // 0x08
    float duration;                     // 0x0C
    int samples;                        // 0x10
    int track_data_init_mode_length;    // 0x14
    int track_data_init_sbyte_length;   // 0x18
    int track_data_init_short_length;   // 0x1C
    int track_data_init_int_length;     // 0x20
    int track_data_mode_length;         // 0x24
    int track_data_mode2_length;        // 0x28
    int track_data_sbyte_length;        // 0x2C
    int track_data_short_length;        // 0x30
    int track_data_int_length;          // 0x44
    int params_mode_length;             // 0x38
    int params_byte_length;             // 0x3C
    int params_ushort_length;           // 0x40
    int params_uint_length;             // 0x44
    int track_flags_length;             // 0x48
    int unknown;                        // In runtime becomes pointer to data after this int
} enb_head;

typedef struct _enb_play_head
{
    int current_sample;                 // 0x00
    float current_sample_time;          // 0x04
    float previous_sample_time;         // 0x08
    enb_head* data_header;              // 0x0C
    track* track_data;                  // 0x10
    int data_length;                    // 0x14
    int unknown[2];                     // 0x18
    float requested_time;               // 0x20
    float seconds_per_sample;           // 0x24
    uint next_params_change;            // 0x28
    uint prev_params_change;            // 0x2C
    byte* track_flags;                  // 0x30
    byte* track_data_init_mode;         // 0x34
    sbyte* track_data_init_sbyte;       // 0x38
    short* track_data_init_short;       // 0x3C
    int* track_data_init_int;           // 0x40
    byte track_data_init_counter;       // 0x44
    byte padding[3];                    // 0x45
    byte* track_data_mode;              // 0x48
    byte* track_data_mode2;             // 0x4C
    sbyte* track_data_sbyte;            // 0x50
    short* track_data_short;            // 0x54
    int* track_data_int;                // 0x58
    byte track_data_mode_counter;       // 0x5C
    byte track_data_mode2_counter;      // 0x5D
    byte padding2[2];                   // 0x5E
    byte* params_mode;                  // 0x60
    byte* params_byte;                  // 0x64
    ushort* params_ushort;              // 0x68
    uint* params_uint;                  // 0x6C
    byte params_counter;                // 0x70
    byte padding3[3];                   // 0x71
    byte* orig_track_data_init_mode;    // 0x74
    sbyte* orig_track_data_init_sbyte;  // 0x78
    short* orig_track_data_init_short;  // 0x7C
    int* orig_track_data_init_int;      // 0x80
    byte* orig_track_data_mode;         // 0x84
    byte* orig_track_data_mode2;        // 0x88
    sbyte* orig_track_data_sbyte;       // 0x8C
    short* orig_track_data_short;       // 0x90
    int* orig_track_data_int;           // 0x94
    byte* orig_params_mode;             // 0x98
    byte* orig_params_byte;             // 0x9C
    ushort* orig_params_ushort;         // 0xA0
    uint* orig_params_uint;             // 0xA4
    byte track_mode_selector;           // 0xA8
    byte track_data_selector;           // 0xA9
    byte padding4[6];                   // 0xAA
} enb_play_head;

__declspec(dllexport) int enb_process(byte* data_in, byte** data_out, int* data_out_len, float* duration, float* fps, int* frames);
static void enb_init(enb_play_head* play_head, enb_head* head);
static void enb_copy_pointers(enb_play_head* play_head);
static void enb_set_time(enb_play_head* play_head, float time);
static void enb_get_track_unscaled_init(enb_play_head* play_head);
static void enb_get_track_unscaled_forward(enb_play_head* play_head);
static void enb_get_track_unscaled_backward(enb_play_head* play_head);
static void enb_calc_params_init(enb_play_head* play_head);
static void enb_calc_params_forward(enb_play_head* play_head);
static void enb_calc_params_backward(enb_play_head* play_head);
static void enb_calc_track_init(enb_play_head* play_head);
static void enb_calc_track(enb_play_head* play_head, float time, bool forward);

const byte shift_table_1[] = { 6, 4, 2, 0 }; // 0x08BF1CE8, 0x08BF2160, 0x08BF210
